In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame([[1,2,3],[2,4,7],[6,4,5]],columns=['a','b','c'])

In [3]:
df1

   a  b  c
0  1  2  3
1  2  4  7
2  6  4  5

In [4]:
df2=pd.DataFrame([[4,22,33],[22,43,71],[61,24,15]],columns=['x','y','z'])

##

In [5]:
df2

    x   y   z
0   4  22  33
1  22  43  71
2  61  24  15

In [24]:
df3 = pd.merge_ordered(df1,df2,right_on='y',left_on='b')

In [25]:
df3

     a    b    c     x     y     z
0  1.0  2.0  3.0   NaN   NaN   NaN
1  2.0  4.0  7.0   NaN   NaN   NaN
2  6.0  4.0  5.0   NaN   NaN   NaN
3  NaN  NaN  NaN   4.0  22.0  33.0
4  NaN  NaN  NaN  61.0  24.0  15.0
5  NaN  NaN  NaN  22.0  43.0  71.0

In [26]:
df3.tail()

     a    b    c     x     y     z
1  2.0  4.0  7.0   NaN   NaN   NaN
2  6.0  4.0  5.0   NaN   NaN   NaN
3  NaN  NaN  NaN   4.0  22.0  33.0
4  NaN  NaN  NaN  61.0  24.0  15.0
5  NaN  NaN  NaN  22.0  43.0  71.0